app/controllers/games_controller.rb

SELECT `games`.* FROM `games`
---
    def index
        @games = Game.all

INSERT INTO `games` (`name`, `release_date`, `created_at`, `updated_at`, `platform`) VALUES ('Red Dead Redemption 2', '2018-10-26', '2018-06-16 02:23:25', '2018-06-16 02:23:25', 'PS4')
---
    def create
        Game.create(game_params)